import Alexandr from '../images/reviews/Alexandr.png';

const reviewsInfo = [
  {
    name: 'Александр',
    assesFlamp: '5.0',
    img: Alexandr,
    href: '/',
    text: 'Выступи в роли переводчика и корректора орфографии. Я буду говорить на любом языке, а ты будешь определять язык, переводить его и отвечать исправленной и улучшенной версией моего текста на английском языке. Замени мои упрощенные слова и предложения уровня A0 на более красивые слова и предложения.'
  },
  {
    name: 'Александр',
    assesFlamp: '5.0',
    img: Alexandr,
    href: '/',
    text: 'Выступи в роли переводчика и корректора орфографии. Я буду говорить на любом языке, а ты будешь определять язык, переводить его и отвечать исправленной и улучшенной версией моего текста на английском языке. Замени мои упрощенные слова и предложения уровня A0 на более красивые слова и предложения.'
  },
  {
    name: 'Александр',
    assesFlamp: '5.0',
    img: Alexandr,
    href: '/',
    text: 'Выступи в роли переводчика и корректора орфографии. Я буду говорить на любом языке, а ты будешь определять язык, переводить его и отвечать исправленной и улучшенной версией моего текста на английском языке. Замени мои упрощенные слова и предложения уровня A0 на более красивые слова и предложения.'
  },
  {
    name: 'Александр',
    assesFlamp: '5.0',
    img: Alexandr,
    href: '/',
    text: 'Выступи в роли переводчика и корректора орфографии. Я буду говорить на любом языке, а ты будешь определять язык, переводить его и отвечать исправленной и улучшенной версией моего текста на английском языке. Замени мои упрощенные слова и предложения уровня A0 на более красивые слова и предложения.'
  },
  {
    name: 'Александр',
    assesFlamp: '5.0',
    img: Alexandr,
    href: '/',
    text: 'Выступи в роли переводчика и корректора орфографии. Я буду говорить на любом языке, а ты будешь определять язык, переводить его и отвечать исправленной и улучшенной версией моего текста на английском языке. Замени мои упрощенные слова и предложения уровня A0 на более красивые слова и предложения.'
  },
]

export default reviewsInfo;